//Печать флажков
#include <stdio.h>
#include <stdlib.h>

#define N 21

int main()
{
	int i,j;
//----------------------------------------------------------------	
	for(i=0; i<N; ++i)									//	*****
	{													//	*****
		for(j=0; j<N; ++j)								//	*****
			putchar('\xDB');								//	*****
		putchar('\n');									//	*****
	}
	system("pause");
	system("cls");
//----------------------------------------------------------------	
	for(i=0; i<N; ++i)									//	*****
	{													//	 ****
		for(j=0; j<N; ++j)								//	  ***
			putchar(i<=j?'\xDB':'\xFA');					//	   **
		putchar('\n');									//	    *
	}
	system("pause");
	system("cls");
//----------------------------------------------------------------	
	for(i=0; i<N; ++i)									//	*****
	{													//	 ****
		for(j=0; j<N; ++j)								//	  ***
			putchar(.....?'\xDB':'\xFA');					//	   **
		putchar('\n');									//	    *
	}
	system("pause");
	system("cls");
//----------------------------------------------------------------	
	return 0;	
}